[
    {
        "task_name": "Provide analysis of company financial statements",
        "steps": [
            "Inquire about the specific company or companies the user is interested in analyzing.",
            "Retrieve and analyze the company's financial data using the company_financial_data_retrieval resource. Provide a summary of the key financial metrics.",
            "Assess the company's competitive positioning within its sector using the competitive_positioning_assessment subtask. Provide insights into the company's strengths and weaknesses relative to competitors.",
            "Analyze broader market trends that may affect the company using the market_trend_analysis subtask, and present these trends to the user.",
            "Evaluate the sector's performance relative to others using the sector_performance_evaluation subtask, and provide context for the company's potential within its sector.",
            "Identify medium-term investment opportunities using the investment_opportunity_identification subtask. Suggest possible actions based on financial health, market trends, and competitive analysis.",
            "Ask the user if they want to proceed with any recommendations or need more information about any aspect of analysis.",
            "Offer to record any trades or update investment notes using the PortfolioWorker if the user decides to take action based on provided insights."
        ]
    },
    {
        "task_name": "Provide analysis of current market trends",
        "steps": [
            "Start the conversation by greeting the user and briefly explaining how the assistant can help with analyzing current market trends. Use the MessageWorker for interaction.",
            "Retrieve recent market data and trends using market_data-alpha_vantage-get_alpha_daily and market_data-fred-get_fred_series. Use these to gather economic and market data.",
            "Incorporate any significant recent news that might impact the market using NewsEventWorker, providing context for the trends.",
            "Perform a sentiment analysis on the gathered data using market_data-sentiment-simple_sentiment to understand current market sentiment.",
            "Analyze the broader market trends using market_trend_analysis. This involves evaluating key indicators and movements.",
            "If needed, further investigate specific sectors using sector_performance_evaluation to provide more detailed insights.",
            "Present the findings to the user using the MessageWorker, summarizing key insights and potential implications for medium-term investments.",
            "Ask the user if they need further details or have specific queries about particular sectors or companies."
        ]
    },
    {
        "task_name": "Provide analysis of sector and industry performance",
        "steps": [
            "Greet the user and inquire which specific sector or industry they are interested in analyzing.",
            "Use the sector_performance_evaluation subtask to gather and analyze relevant sector-specific data and trends.",
            "Fetch recent news and articles related to the selected sector or industry using the NewsEventWorker to provide current context.",
            "Apply the market_trend_analysis subtask to evaluate broader market trends that might impact the selected sector or industry.",
            "Provide the analysis summary to the user, highlighting key trends, insights, and potential impacts on the sector or industry.",
            "Ask the user if they need further analysis or have any specific questions about the sector or industry."
        ]
    },
    {
        "task_name": "Provide information on company's competitive positioning",
        "steps": [
            "Ask the user for the name of the company they are interested in analyzing.",
            "Using the competitive_positioning_assessment resource, assess the company's position relative to its competitors, focusing on market share, strengths, weaknesses, and strategic advantages.",
            "Present a summary of the company's competitive positioning to the user through the MessageWorker, highlighting key strengths and weaknesses.",
            "Inquire if the user needs further information or analysis on any specific aspect of the company's competitive positioning.",
            "If requested, perform additional analysis or clarifications, then provide the updated information to the user. Otherwise, ask if there is anything else the user would like assistance with."
        ]
    },
    {
        "task_name": "Suggest potential medium-term investment opportunities",
        "steps": [
            "Utilize the NewsEventWorker to present recent market news and events to provide context for investment considerations.",
            "Ask the user if they have specific sectors or industries they are interested in exploring for investment opportunities.",
            "Retrieve and analyze financial data using company_financial_data_retrieval for companies within the chosen sectors to assess their financial health.",
            "Use sector_performance_evaluation to provide insights on how selected sectors are performing relative to others.",
            "Perform competitive_positioning_assessment to analyze chosen companies' strengths, weaknesses, and market position.",
            "Conduct market_trend_analysis to evaluate key market indicators and their potential impact on investment decisions.",
            "Utilize investment_opportunity_identification to generate a list of potential medium-term investment opportunities based on data analysis.",
            "Present the curated list of potential investment opportunities to the user and ask if they need further details or assistance with portfolio management.",
            "Use the PortfolioWorker to assist the user in recording trades or managing existing portfolio positions if requested."
        ]
    }
]