[
    {
        "task_name": "Provide analysis of financial statements",
        "steps": [
            "Retrieve and gather necessary financial and market data about the company from available resources.",
            "Prepare the collected data by cleaning and organizing it to ensure accuracy in subsequent analysis.",
            "Perform a detailed financial analysis by interpreting financial statements and calculating key financial ratios.",
            "Conduct a market position analysis by evaluating the company's market share, competitors, and market trends.",
            "Provide a well-rounded investment recommendation considering the financial and market position analyses.",
            "Ask if the user requires further assistance or has any additional questions."
        ]
    },
    {
        "task_name": "Calculate and explain financial ratios",
        "steps": [
            "Initiate conversation by asking the user for the specific company they are interested in analyzing.",
            "Use the CompanyRAGWorker to retrieve and gather necessary financial and market data about the specified company.",
            "Clean and organize the collected data using data_analysis_preparation to ensure it is ready for detailed analysis.",
            "Perform financial analysis by calculating key financial ratios such as profitability, liquidity, and solvency using the financial_analysis process.",
            "Generate an explanation of the calculated financial ratios and their implications for investment decisions, and communicate this information to the user via the MessageWorker.",
            "Ask the user if they would like further details or analysis about specific financial ratios or additional insights into the company's market position.",
            "If requested, analyze the company's market position using the market_position_analysis task, and provide insights about competitors and market trends.",
            "Offer a medium-term investment recommendation by integrating financial ratios and market position analysis, ensuring the user is well-informed of potential risks and benefits."
        ]
    },
    {
        "task_name": "Analyze market position and competitive landscape",
        "steps": [
            "Use CompanyRAGWorker to retrieve and analyze the company's filings and documents to understand its financial health and strategy.",
            "Use market_position_analysis to assess the company's current market share, identify competitors, and evaluate market trends.",
            "Employ SearchWorker to gather real-time competitive landscape information and market conditions.",
            "Use StoryMemoryWorker to persist conversation stories and key findings for user reference.",
            "Utilize investment_recommendation_analysis to form a medium-term investment recommendation and present it using MessageWorker."
        ]
    },
    {
        "task_name": "Provide historical stock performance analysis",
        "steps": [
            "Start the conversation by asking the user for the specific company they are interested in analyzing for historical stock performance.",
            "Retrieve historical stock data for the specified company using the market_data-alpha_vantage-get_alpha_daily resource.",
            "Using the data_analysis_preparation task, clean and organize the fetched historical stock data for accurate analysis.",
            "Perform a financial analysis to evaluate the past performance metrics of the company using the financial_analysis resource.",
            "Deliver the analysis results back to the user, highlighting key insights on historical stock trends and performance.",
            "Ask the user if they need further details or have any questions regarding the analysis provided.",
            "If the user has additional questions or needs more analysis, utilize the appropriate resources and repeat steps 2-5 as necessary.",
            "Once analysis needs are satisfied, ask the user if they need assistance with any other company or investment inquiries."
        ]
    },
    {
        "task_name": "Provide medium-term investment recommendations",
        "steps": [
            "Inquire about the user's investment objectives and risk tolerance.",
            "Collect necessary financial and market data for companies of interest using company_data_collection.",
            "Prepare the collected data for analysis using data_analysis_preparation.",
            "Conduct financial analysis to evaluate the company's financial health using financial_analysis.",
            "Analyze the company's market position using market_position_analysis.",
            "Calculate risk metrics such as Value at Risk (VaR), max drawdown, and Sharpe ratio using the corresponding portfolio-risk_metrics functions.",
            "Use investment_recommendation_analysis to synthesize findings and provide medium-term investment recommendations.",
            "Ask the user if they need further information or clarification about the recommendations provided.",
            "Offer assistance with tracking portfolio positions, recording trades, or managing investment notes using PortfolioWorker."
        ]
    }
]