[
    {
        "task_name": "Provide analysis of company financial statements",
        "steps": [
            "Inquire which company's financial statements the user is interested in analyzing and any specific metrics they are focused on.",
            "Use CompanyRAGWorker to retrieve and parse the requested company's latest financial statements from filings and documents.",
            "Deliver an initial analysis of the company's financial statements using MessageWorker, highlighting key financial metrics and any notable trends.",
            "Ask if the user would like a deeper analysis on specific aspects, such as comparative analysis with competitors or trend analysis on certain financial metrics.",
            "If requested, perform the comparative or trend analysis and provide detailed insights using MessageWorker. Also, offer to conduct a real-time search for any additional market data if needed using SearchWorker."
        ]
    },
    {
        "task_name": "Assist in evaluating market trends",
        "steps": [
            "Inquire about the user's specific needs or areas of interest regarding market trends they are interested in analyzing.",
            "Use market_data-fred-get_fred_series and market_data-alpha_vantage-get_alpha_daily to collect relevant financial and economic data.",
            "Perform trend_analysis to assess historical data and identify patterns or trends based on the data collected.",
            "Deliver the key findings and insights from the trend analysis to the user using MessageWorker.",
            "Ask the user if they would like further analysis or recommendations based on the trends identified, or if they need information on specific companies.",
            "Provide additional analyses or recommendations as requested (e.g., carry out comparative_analysis if the user is interested in specific companies)."
        ]
    },
    {
        "task_name": "Facilitate company comparison",
        "steps": [
            "Inquire which companies the user is interested in comparing and any specific metrics or aspects they wish to focus on (e.g., financial health, market position).",
            "Retrieve relevant data for the specified companies using CompanyRAGWorker and market data resources. Assess and analyze the data for key metrics that align with the user's focus.",
            "Perform comparative analysis to evaluate the companies across the specified metrics and summarize key findings. Highlight strengths and weaknesses.",
            "Deliver the comparative analysis results to the user via MessageWorker. Ask if the user would like additional information or a deeper dive into specific areas.",
            "Confirm if the user needs further assistance in making an investment decision or if they want to record preferences or observations in their portfolio using PortfolioWorker."
        ]
    },
    {
        "task_name": "Provide medium-term investment recommendations",
        "steps": [
            "Initiate the conversation by asking the user about their specific investment goals and risk tolerance for medium-term investments.",
            "Utilize the CompanyRAGWorker to gather and analyze the company's filings and documents that are relevant to the user's investment criteria.",
            "Obtain and analyze data using market_data-alpha_vantage-get_alpha_daily and market_data-fred-get_fred_series to provide insights into the market and economic conditions.",
            "Conduct trend analysis and comparative analysis based on gathered data to identify potential investment opportunities.",
            "Generate medium-term investment recommendations using the investment_recommendation_generation subtask and present options to the user.",
            "Ask the user if they need further information or have specific companies they want to focus on.",
            "Utilize PortfolioWorker to record any decisions made by the user regarding trades or notes on potential investments.",
            "Summarize the session, confirm action items, and propose a plan for monitoring investment performance."
        ]
    },
    {
        "task_name": "Deliver updates on stock performance",
        "steps": [
            "Retrieve the most recent stock performance data using 'market_data-alpha_vantage-get_alpha_daily' for the relevant company.",
            "Deliver stock performance updates to the user using 'MessageWorker'.",
            "Check if the user wants additional historical trend insights and use 'trend_analysis' to provide a summary.",
            "Inquire if the user wants a comparative analysis with other companies using 'comparative_analysis'.",
            "If the user requests, offer medium-term investment recommendations using 'investment_recommendation_generation'.",
            "Store key conversation points using 'StoryMemoryWorker' for future reference and personalized interactions."
        ]
    }
]