[
    {
        "task_name": "Analyze key financial metrics from company filings",
        "steps": [
            "Initiate the conversation by asking the user for the name of the company they are interested in analyzing.",
            "Use the CompanyRAGWorker to retrieve and present key financial metrics from the most recent company filings to the user.",
            "Inquire if the user wants to compare these metrics with another company or with industry benchmarks.",
            "If the user opts for comparison, use comparative_analysis to compare the specified financial metrics and deliver insights to the user.",
            "Ask the user if they would like further analysis on market trends or risk assessment for the company in question.",
            "If the user requests it, use analyze_market_data to provide current market trends or risk_assessment to identify any potential risks.",
            "Offer to generate medium-term investment recommendations based on the analyzed data.",
            "Provide the recommendations and ask if the user needs additional information or assistance with managing their portfolio."
        ]
    },
    {
        "task_name": "Provide insights on market trends based on current data",
        "steps": [
            "MessageWorker prompts the user to specify any particular market trends or sectors they are interested in analyzing.",
            "Utilize SearchWorker to gather the latest market trends and relevant news for the specified trends or sectors in real-time.",
            "Use the market_data-alpha_vantage-get_alpha_daily and market_data-fred-get_fred_series to fetch current market data and economic series related to the specified sectors.",
            "Apply analyze_market_data subtask to synthesize the collected data, extracting insights on recent market movements and trends.",
            "MessageWorker communicates the synthesized insights back to the user, highlighting key trends and data-driven conclusions.",
            "Inquire if the user would like additional analyses, comparisons, or if they're interested in specific investment recommendations."
        ]
    },
    {
        "task_name": "Assess risk factors associated with potential investments",
        "steps": [
            "Prompt the user to specify the companies or investments they are interested in assessing for risk factors.",
            "Use the CompanyRAGWorker to gather information from company filings and documents, extracting key financial metrics relevant to risk assessment.",
            "Leverage the market_data-alpha_vantage-get_alpha_daily and market_data-fred-get_fred_series to analyze current market conditions and trends affecting the investments.",
            "Apply risk assessment metrics such as portfolio-risk_metrics-value_at_risk, portfolio-risk_metrics-max_drawdown, and portfolio-risk_metrics-sharpe_ratio to evaluate potential risks for the specified investments.",
            "Summarize the identified risk factors and present the findings to the user using the MessageWorker.",
            "Ask if the user needs further analysis or recommendations on managing these risks."
        ]
    },
    {
        "task_name": "Generate medium-term investment recommendations based on analysis",
        "steps": [
            "Ask the user for specific sectors or companies they are interested in for investment.",
            "Retrieve and analyze the necessary company filings and documents using CompanyRAGWorker.",
            "Fetch the relevant market data using market_data-alpha_vantage-get_alpha_daily and market_data-fred-get_fred_series, then analyze the current market trends.",
            "Perform a comparative analysis of the selected companies using extract_financial_data and comparative_analysis.",
            "Conduct a risk assessment using risk_assessment, portfolio-risk_metrics-value_at_risk, portfolio-risk_metrics-max_drawdown, and portfolio-risk_metrics-sharpe_ratio.",
            "Generate medium-term investment recommendations based on the analysis using generate_investment_recommendations.",
            "Present the findings and recommendations to the user using MessageWorker and ask if they need further insights or have additional questions.",
            "Record any investment decisions or notes in the user's portfolio using PortfolioWorker, if the user decides to act on the recommendations."
        ]
    },
    {
        "task_name": "Conduct comparative analysis of multiple companies",
        "steps": [
            "Ask the user to provide a list of companies they are interested in for comparative analysis.",
            "Extract key financial metrics from the company's filings for each company using the CompanyRAGWorker and extract_financial_data.",
            "Analyze current market trends for each company using market_data-alpha_vantage-get_alpha_daily and analyze_market_data.",
            "Evaluate risk factors associated with each company using risk_assessment.",
            "Perform comparative analysis of the financial metrics and market performance of the companies using comparative_analysis.",
            "Provide a summary of the comparative analysis, highlighting strengths and weaknesses of each company.",
            "Ask the user if they would like investment recommendations based on the analysis using generate_investment_recommendations.",
            "Provide investment recommendations if requested by the user.",
            "Check if the user needs additional assistance or further information."
        ]
    }
]