[
    {
        "task_name": "Provide analysis of company financial statements",
        "steps": [
            "Inquire about the specific company or industries the user is interested in analyzing.",
            "Utilize the CompanyRAGWorker to retrieve relevant financial statements and filings for the specified company. Ensure the data is then normalized and preprocessed for analysis.",
            "Perform financial analysis on the retrieved data using financial_analysis_execution to derive key insights such as ratios and trends.",
            "Utilize the NewsEventWorker and SearchWorker to provide recent news articles and real-time search results that may impact the financial performance of the company.",
            "Present a summary report to the user, highlighting key financial metrics, analysis insights, and any pertinent news or market trends.",
            "Ask if the user needs further analysis on another company, requests additional details or insights, or if they have further questions."
        ]
    },
    {
        "task_name": "Provide insights on current market trends",
        "steps": [
            "Use the NewsEventWorker to gather recent news articles and events related to the market.",
            "Utilize the SearchWorker to perform real-time searches for trending market analysis and opinions.",
            "Apply market_data-fred-get_fred_series to collect relevant economic time series data from FRED.",
            "Execute data_normalization_and_preprocessing to clean and format the collected data for analysis.",
            "Perform market_trend_identification by analyzing the gathered data and identifying prevailing market trends.",
            "Use the MessageWorker to deliver insights and findings on market trends to the user.",
            "Ask the user if they need further analysis or insights on specific sectors or companies.",
            "Provide additional information using CompanyRAGWorker or Market Sentiment Analysis if requested by the user."
        ]
    },
    {
        "task_name": "Provide sector-based company comparison",
        "steps": [
            "Inquire about the specific sector the user is interested in for company comparison.",
            "Use CompanyRAGWorker to gather data from company filings and documents relevant to the selected sector.",
            "Utilize data_collection_and_retrieval to ensure comprehensive data gathering on companies within the sector.",
            "Apply data_normalization_and_preprocessing to clean and prepare the data for analysis.",
            "Conduct financial_analysis_execution to perform comparative analysis among companies within the sector.",
            "Leverage NewsEventWorker to include recent news articles that may impact the sector and company performance.",
            "Use performance_reporting to generate a summary report with actionable insights and recommendations for the user.",
            "Ask the user if they need further clarification or additional comparisons with other sectors."
        ]
    },
    {
        "task_name": "Provide detailed analysis of company performance",
        "steps": [
            "Initiate a conversation with the user to understand the specific company or sector they are interested in analyzing for medium-term stock investments.",
            "Use the CompanyRAGWorker to gather detailed filings and documents about the company, and apply data_collection_and_retrieval to ensure comprehensive data acquisition from various sources.",
            "Perform data_normalization_and_preprocessing to clean and organize the gathered data for analysis.",
            "Conduct financial_analysis_execution, using stored data to perform ratio, trend, and comparative analysis, to derive insights into the company's performance.",
            "Deploy the NewsEventWorker to gather recent market news and events related to the company to provide current context for the analysis.",
            "Utilize market_trend_identification to analyze macroeconomic indicators and sector trends that might impact the investment decision.",
            "Compile and present a performance_reporting summary that outlines the analysis results, offering actionable insights and recommendations based on the data to the user.",
            "Ask if the user requires further details or any additional analysis to assist in making informed investment decisions."
        ]
    }
]