[
    {
        "task_name": "Provide analysis on company financial statements",
        "steps": [
            "Inquire about the specific company or companies the user is interested in analyzing for investments.",
            "Gather necessary filings and market data related to the specified company/companies using the data_collection_and_retrieval resource.",
            "Provide an overview of the company's financial health and performance through financial_statement_analysis using CompanyRAGWorker.",
            "Analyze current market trends that may impact the company's stock performance using market_trend_analysis.",
            "Determine the stock's intrinsic value using stock_valuation to identify whether it's undervalued or overvalued.",
            "Assess potential risks associated with investing in the company's stock using investment_risk_assessment.",
            "Summarize the analysis and provide tailored investment suggestions to the user.",
            "Ask if the user has further questions or needs additional analysis on another company or financial aspect."
        ]
    },
    {
        "task_name": "Provide insights on current market trends affecting investments",
        "steps": [
            "Use the MessageWorker to greet the user and ask if they are looking for insights on current market trends affecting investments.",
            "Use the SearchWorker to gather real-time information about current market trends potentially affecting investments.",
            "Utilize the market_trend_analysis subtask to analyze the collected data and identify significant trends impacting the investment landscape.",
            "Employ the CompanyRAGWorker to provide context or historical information from company filings and documents to support or contrast the current market trends.",
            "Combine insights from FaissRAGWorker and market_data-fred-get_fred_series to provide specific data-driven insights related to the current trends.",
            "Use the StoryMemoryWorker to store the conversation for future reference and continuity.",
            "Deliver the insights to the user through the MessageWorker, highlighting the key market trends and their potential implications on investments.",
            "Ask the user if they have any specific questions or need further analysis on particular market trends or investment opportunities."
        ]
    },
    {
        "task_name": "Assist in stock valuation using financial ratios and metrics",
        "steps": [
            "Initiate the conversation and ask the user which company they are interested in for stock valuation.",
            "Fetch relevant company filings and market data using data_collection_and_retrieval resources.",
            "Analyze the financial statements of the company using financial_statement_analysis subtask to assess its financial health.",
            "Evaluate the current market trends connected to the company with market_trend_analysis subtask.",
            "Perform stock valuation using financial ratios and valuation methods with stock_valuation subtask to determine intrinsic value.",
            "Discuss potential investment risks using investment_risk_assessment subtask to provide a comprehensive view of risk.",
            "Summarize the findings and provide a final recommendation or answer any further questions the user may have."
        ]
    },
    {
        "task_name": "Provide risk assessment for potential stock investments",
        "steps": [
            "Ask the user for the company or stock they are interested in and any specific concerns they may have regarding investment risks.",
            "Use CompanyRAGWorker to gather insights from company filings and documents specific to the company or stock provided by the user.",
            "Fetch and analyze daily time series data using market_data-alpha_vantage-get_alpha_daily and relevant economic indicators using market_data-fred-get_fred_series to evaluate market conditions.",
            "Conduct financial statement analysis to assess the financial health and performance of the company using financial_statement_analysis.",
            "Perform investment risk assessment focusing on potential risks identified from the data and analysis conducted in the previous steps using investment_risk_assessment.",
            "Provide a comprehensive risk assessment report to the user addressing their specific concerns, utilizing MessageWorker for delivery.",
            "Ask if the user needs any further explanation or additional information regarding other potential investments."
        ]
    },
    {
        "task_name": "Offer comparisons between multiple stocks based on key criteria",
        "steps": [
            "Initiate the conversation with the user and inquire about the specific stocks or criteria they are interested in comparing.",
            "Retrieve relevant financial filings and documents using CompanyRAGWorker for the specified stocks.",
            "Fetch real-time market data for the specified stocks using market_data-alpha_vantage-get_alpha_daily and market_data-fred-get_fred_series services.",
            "Perform financial statement analysis on the retrieved data to assess each company's financial health.",
            "Conduct a market trend analysis to understand the current trends that may impact the selected stocks.",
            "Utilize stock valuation techniques to determine the intrinsic value of each stock and compare them based on valuation metrics.",
            "Evaluate the potential investment risks associated with the stocks using investment risk assessment methods.",
            "Present the analysis results and comparisons to the user, highlighting key differences and potential investment opportunities.",
            "Ask the user if they need further clarification or if they have additional stocks or criteria for comparison."
        ]
    }
]