[
    {
        "task_name": "Provide analysis of company's financial statements",
        "steps": [
            "Use the MessageWorker to inquire which company's financial statements the user wants to analyze.",
            "Retrieve the company's financial data and relevant market information using the retrieve_company_data resource.",
            "Use the CompanyRAGWorker to analyze the company's financial statements, focusing on key metrics like revenue, expenses, and profitability.",
            "Utilize the MessageWorker to present the analysis to the user, highlighting critical financial health indicators.",
            "Ask the user if they need further information or insights on market trends or comparative analysis with other companies using the MessageWorker.",
            "If the user requests further analysis, use the appropriate resources (e.g., compare_financial_metrics, market_trends_insights) to provide additional insights.",
            "Confirm if the user needs to store any notes or add this analysis to their portfolio for future reference using the PortfolioWorker."
        ]
    },
    {
        "task_name": "Provide insights on current market trends",
        "steps": [
            "Use MessageWorker to greet the user and ask how they would like to gain insights into current market trends.",
            "Employ NewsEventWorker to gather recent market-related news or events and present them to the user for context.",
            "Invoke SearchWorker to conduct a real-time search of online resources for the latest market trends and insights, and share the findings with the user.",
            "Leverage market_data-alpha_vantage-get_alpha_daily to retrieve daily market data for relevant stocks or indices to provide a quantitative perspective on market trends.",
            "Utilize market_data-sentiment-simple_sentiment to perform sentiment analysis on the gathered news articles or market communications to offer further insights into market sentiment.",
            "Apply market_trends_insights to analyze and interpret the identified market trends, providing holistic insights into potential impacts on investments.",
            "Ask the user if they need further clarification or additional insights, and provide a summary of the key findings from the market trends analysis.",
            "Confirm with the user if they would like to explore investment opportunities based on the insights or need assistance with any specific stock or sector analysis."
        ]
    },
    {
        "task_name": "Provide comparison of financial metrics of selected companies",
        "steps": [
            "Interact with the user to identify the companies they want to compare and the specific financial metrics they are interested in.",
            "Retrieve necessary financial data for the selected companies using the 'retrieve_company_data' subtask.",
            "Utilize the 'compare_financial_metrics' to analyze the financial metrics of the selected companies.",
            "Present the comparative analysis to the user using the 'MessageWorker', highlighting key differences and insights.",
            "Ask if the user needs further information or insights, such as industry performance or market trends, to contextualize the comparison."
        ]
    },
    {
        "task_name": "Provide analysis of industry performance",
        "steps": [
            "Utilize the SearchWorker to gather up-to-date performance data and trends for the specified industry sector.",
            "Use the FaissRAGWorker to retrieve and summarize insights from the company's internal documentation related to industry performance.",
            "Invoke the NewsEventWorker to scan for recent news articles that might impact the industry's performance.",
            "Apply the industry_performance_analysis subtask to compile and interpret the data collected, focusing on key performance indicators and trends within the industry.",
            "Deliver a summary of the industry performance analysis to the user through the MessageWorker, providing clear insights and potential implications for medium-term stock investments.",
            "Ask if the user requires further industry-specific details or has any additional queries regarding investment decisions."
        ]
    },
    {
        "task_name": "Provide assessment of investment risk factors",
        "steps": [
            "Use retrieve_company_data to gather financial statements, stock prices, and market data related to the company of interest.",
            "Use CompanyRAGWorker to analyze company filings and documents, focusing on identifying any significant disclosures related to risks.",
            "Apply assess_investment_risks to identify and evaluate various risk factors, such as financial performance, market volatility, and external threats.",
            "Utilize NewsEventWorker to check for recent news that might present risk factors or influence the company's stock performance.",
            "Communicate the identified risk factors to the user using MessageWorker, ensuring clarity in the explanation.",
            "Ask the user if they need further analysis on certain risk factors or additional information via MessageWorker.",
            "If requested, delve deeper using analyze_financial_statements for more granular insights or compare_financial_metrics for peer comparison."
        ]
    }
]