[
    {
        "task_name": "Provide analysis of company financial statements",
        "steps": [
            "Greet the user and inquire about the specific company or companies they are interested in analyzing.",
            "Use the CompanyRAGWorker to fetch relevant financial filings and documents for the specified companies.",
            "Perform financial_statement_analysis to understand the company's financial health and performance trends.",
            "Compile the findings and prepare a summary of key financial metrics and trends using the MessageWorker to communicate with the user.",
            "Ask the user if they wish to compare the analysis with other companies or if they need a detailed breakdown of any specific financial metric.",
            "If the user wants a comparison, utilize comparative_company_analysis to provide a comparative overview and highlight differences.",
            "Provide insights into the market trends or risks associated with the company using market_trend_analysis and risk_assessment.",
            "Offer stock_valuation insights to assess whether the stock is undervalued or overvalued.",
            "Conclude by summarizing the findings, offering any necessary clarifications, and asking the user if they require further assistance or have additional questions."
        ]
    },
    {
        "task_name": "Provide analysis of market trends",
        "steps": [
            "Initiate the conversation by asking the user if they are interested in analyzing current market trends or specific sectors.",
            "Use the NewsEventWorker to provide recent articles and news snippets relevant to the user's interest as context for market trend analysis.",
            "Leverage the market_data-alpha_vantage-get_alpha_daily and market_data-fred-get_fred_series to fetch recent market data series based on the user's interest.",
            "Perform market_trend_analysis using the data collected; provide insights on recent trends, potential growth areas, or downturns based on the analysis.",
            "Ask the user if they need further analysis on a specific company or sector, or if they want additional insights on market conditions.",
            "If requested, use the CompanyRAGWorker to dive deeper into specific company filings or documents to provide detailed analysis on financial health and performance trends.",
            "Summarize the findings for the user and ask if they need assistance with any investment strategies or wish to record any notes in their portfolio using the PortfolioWorker."
        ]
    },
    {
        "task_name": "Offer comparative analysis of companies",
        "steps": [
            "Initiate the conversation by asking the user about the specific companies they are interested in comparing or the criteria they use for comparison.",
            "Retrieve data from company filings and documents using CompanyRAGWorker to gather detailed financial and market information about the specified companies.",
            "Fetch the latest market trends and economic data using market_data-alpha_vantage-get_alpha_daily and market_data-fred-get_fred_series to incorporate external market conditions into the analysis.",
            "Perform a comparative analysis using comparative_company_analysis to yield insights into the strengths and weaknesses of the companies based on their financial performance and market position.",
            "Integrate relevant news and events by leveraging NewsEventWorker to capture any recent developments that could impact the companies' performance.",
            "Present the comparative analysis results to the user, highlighting key differences, potential investment opportunities, and any risks identified during risk_assessment.",
            "Ask the user if they need additional analysis or have specific questions regarding the comparative analysis provided.",
            "If the user decides to proceed with investment, use PortfolioWorker to assist in recording trades, managing investment notes, or evaluating portfolio positions."
        ]
    },
    {
        "task_name": "Assess investment risk factors",
        "steps": [
            "Initiate the conversation by asking the user about any specific companies or sectors they are interested in analyzing for medium-term stock investments.",
            "Use the CompanyRAGWorker to gather data from filings and documents related to the specified companies or sectors.",
            "Utilize the NewsEventWorker to fetch recent news articles and events that may affect the companies or sectors of interest.",
            "Apply the market_data-alpha_vantage-get_alpha_daily and market_data-fred-get_fred_series resources to collect relevant market data.",
            "Perform financial_statement_analysis and market_trend_analysis to evaluate the company's financial health and current market trends.",
            "Conduct a comparative_company_analysis to identify how the target company stands against its competitors.",
            "Execute risk_assessment to evaluate potential risks associated with the investment.",
            "Calculate risk metrics using portfolio-risk_metrics-value_at_risk, portfolio-risk_metrics-max_drawdown, and portfolio-risk_metrics-sharpe_ratio to provide insight into investment risk.",
            "Provide an assessment of the investment risk factors using the MessageWorker to communicate findings to the user, along with any relevant insights from the sentiment analysis.",
            "Ask the user if they need further analysis, have additional questions, or wish to proceed with a closer look at potential investment actions."
        ]
    },
    {
        "task_name": "Determine the valuation of specific stocks",
        "steps": [
            "Ask the user which specific stock they are interested in for valuation.",
            "Use the CompanyRAGWorker to gather recent filings and disclosure information for the specified stock.",
            "Fetch daily market data for the specified stock using market_data-alpha_vantage-get_alpha_daily.",
            "Analyze the company's financial statements using the financial_statement_analysis resource to evaluate its financial health.",
            "Perform stock valuation using the stock_valuation resource to assess intrinsic value.",
            "Utilize market_trend_analysis to evaluate any relevant market trends impacting the stock's performance.",
            "Communicate the results of the valuation and analysis to the user.",
            "Ask the user if they need additional analysis, such as a comparative analysis with similar companies or further risk assessment.",
            "Provide a summary and offer guidance on potential investment decisions based on the valuation analysis."
        ]
    }
]